channelWithObstacle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0 0 0)
    (3 0 0)
    (4 0 0)
    (8 0 0)
    (4 0.5 0)
    (8 0.5 0)
    (0 2 0)
    (3 2 0)
    (4 2 0)
    (8 2 0)
    (0 0 1)
    (3 0 1)
    (4 0 1)
    (8 0 1)
    (4 0.5 1)
    (8 0.5 1)
    (0 2 1)
    (3 2 1)
    (4 2 1)
    (8 2 1)
);

blocks
(
    hex (0 1 7 6 10 11 17 16) (30 20 1) simpleGrading 
    (
        (      
           1                //no grading in x
        )
        (      
           (0.2 0.3 4)      //division 1
           (0.6 0.4 1)      //division 2
           (0.2 0.3 0.25)   //division 3
        )
        (      
           1                //no grading in z
        )
    )
    hex (1 4 8 7 11 14 18 17) (10 20 1) simpleGrading 
    (
        (      
           1                //no grading in x
        )
        (      
           (0.2 0.3 4)      //division 1
           (0.6 0.4 1)      //division 2
           (0.2 0.3 0.25)   //division 3
        )
        (      
           1                //no grading in z
        )
    )
    hex (2 3 5 4 12 13 15 14) (40 20 1) simpleGrading (1 1 1)
    hex (4 5 9 8 14 15 19 18) (40 20 1) simpleGrading
    (
        (      
           1                //no grading in x
        )
        (      
           (0.2 0.3 4)      //division 1
           (0.6 0.4 1)      //division 2
           (0.2 0.3 0.25)   //division 3
        )
        (      
           1                //no grading in z
        )
    )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 10 16 6)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 9 19 15)
            (3 5 15 13)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 11 10)
            (1 4 14 11)
            (4 2 12 14)
            (2 3 13 12)
            (6 16 17 7)
            (8 7 17 18)
            (9 8 18 19)
        );
    }
);


// ************************************************************************* //